{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv1", 
      "inputs": [[0, 0], [1, 0], [2, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "prelu1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "prelu1", 
      "inputs": [[3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "name": "pool1", 
      "inputs": [[5, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv2", 
      "inputs": [[6, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "prelu2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "prelu2", 
      "inputs": [[9, 0], [10, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "name": "pool2", 
      "inputs": [[11, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv3", 
      "inputs": [[12, 0], [13, 0], [14, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "prelu3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "prelu3", 
      "inputs": [[15, 0], [16, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "name": "pool3", 
      "inputs": [[17, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv4_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv4_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(2,2)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv4", 
      "inputs": [[18, 0], [19, 0], [20, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "prelu4_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "prelu4", 
      "inputs": [[21, 0], [22, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv5_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv5_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "256"
      }, 
      "name": "conv5", 
      "inputs": [[23, 0], [24, 0], [25, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "prelu5_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "prelu5", 
      "inputs": [[26, 0], [27, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv6_3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv6_3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "name": "conv6_3", 
      "inputs": [[28, 0], [29, 0], [30, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv6_2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv6_2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "4"
      }, 
      "name": "conv6_2", 
      "inputs": [[28, 0], [32, 0], [33, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv6_1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv6_1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "name": "conv6_1", 
      "inputs": [[28, 0], [35, 0], [36, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "prob1_label", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SoftmaxOutput", 
      "param": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "False", 
        "normalization": "null", 
        "use_ignore": "False"
      }, 
      "name": "prob1", 
      "inputs": [[37, 0], [38, 0]], 
      "backward_source_id": -1
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    7, 
    8, 
    10, 
    13, 
    14, 
    16, 
    19, 
    20, 
    22, 
    24, 
    25, 
    27, 
    29, 
    30, 
    32, 
    33, 
    35, 
    36, 
    38
  ], 
  "heads": [[31, 0], [34, 0], [39, 0]]
}